app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."isFlagged" = $1 ORDER BY "posts"."created_at" DESC  [["isFlagged", false]]
---
    def recent_posts
        @votes = Vote.all
        @posts = Post.where(:isFlagged => false).order(created_at: :desc)